Repository: LingmoOS/LingmoOS
Catalog: shell32/lingmo-shell/po/*/kcm_baloofile.po
Languages: is

source: This module lets you configure the file indexer and search functionality.
is: Í þessari einingu geturðu stillt atriðaskráningu og leitarvirkni.

source: This will disable file searching in LingmoRunnerand launcher menus, and remove extended metadata display from all KDE applications.
is: Þetta gerir skráaleit óvirka í LingmoRunnerog forritavalmyndum og fjarlægir ítarlega birtingu lýsigagna úr öllum KDE-forritum.

source: Do you want to delete the saved index data? %1 of space will be freed, but if indexing is re-enabled later, the entire index will have to be re-created from scratch. This may take some time, depending on how many files you have.
is: Viltu eyða vistuðum atriðaskráningargögnum? Það losar %1 af diskplássi en ef atriðaskráning er virkjuð aftur síðar þarf að endurgera alla atriðaskrána upp á nýtt. Það getur tekið talsverðan tíma, allt eftir því hvað þú ert með margar skrár.

source: Delete Index Data
is: Eyða atriðaskráningargögnum

source: The system must be restarted before these changes will take effect.
is: Endurræsa verður tölvuna til að breytingarnar taki gildi.

# @action:button
source: Restart
is: Endurræsa

source: File Search helps you quickly locate all your files based on their content.
is: Með skráaleit geturðu fundið allar skrárnar þínar eftir innihaldi þeirra.

source: Enable File Search
is: Virkja skráaleit

source: Also index file content
is: Atriðaskrá einnig innihald skráa

source: Index hidden files and folders
is: Atriðaskrá faldar skrár og möppur

source: Status: %1, %2% complete
is: Staða: %1, %2% lokið

source: Pause Indexer
is: Gera hlé á skráningu

source: Resume Indexer
is: Halda áfram skráningu

source: Currently indexing: %1
is: Er að skrá núna: %1

source: Folder specific configuration:
is: Grunnstilling fyrir möppu:

source: Start indexing a folder…
is: Hefja skráningu á möppu...

source: Stop indexing a folder…
is: Hætta skráningu á möppu...

source: Not indexed
is: Ekki skráð

source: Indexed
is: Skráð...

source: Delete entry
is: Eyða færslu

source: Select a folder to include
is: Velja möppu sem á að taka með

source: Select a folder to exclude
is: Velja möppu sem á að útiloka
