Repository: LingmoOS/LingmoOS
Catalog: distribution/win32-loader/l10n/po/*.po
Languages: is, pt

source: LANG_ENGLISH
is: LANG_ICELANDIC
pt: LANG_PORTUGUESE

source: English
is: Icelandic
pt: Portuguese

# NLFID
source: English
is: Icelandic
pt: Portuguese

source: $target_distro $kernel_name - Continue with install process
is: $target_distro $kernel_name - Halda afram med uppsetningu
pt: $target_distro $kernel_name - Continuar com o processo de instalação

source: PXE - Network boot
is: PXE - Ræsing af neti
pt: PXE - Arranque através da rede

source: Debian-Installer loader
is: Debian-Installer uppsetningaforrit
pt: Carregador do Instalador Debian

source: Cannot find win32-loader.ini.
is: Finn ekki win32-loader.ini.
pt: Não foi possível encontrar o win32-loader.ini

source: win32-loader.ini is incomplete. Contact the provider of this medium.
is: win32-loader.ini er ófullnægjandi. Hafðpu samband við þann sem útbjó þennan disk.
pt: O win32-loader.ini está incompleto. Contacte quem lhe disponibilizou este meio.

source: This program has detected that your keyboard type is "$0". Is this correct?
is: Forritið hefur skynjað að gerð lyklaborðisns þíns sé "$0". Er það rétt?
pt: Este programa detectou que o tipo do seu teclado é "$0". Isto está correcto?

source: Please send a bug report with the following information: - Version of Windows. - Country settings. - Real keyboard type. - Detected keyboard type. Thank you.
is: Endilega sendu villuskýrslu með eftirfarandi upplýsingum: - Útgáfa Windows. - Stillingar lands. - Raunverulegt lyklaborð. - Skynjað lyklaborð. Takk fyrir.
pt: Por favor envie um relatório de bug com as seguintes informações: - Versão do Windows. - Definições do país. - Verdadeiro tipo do teclado. - Tipo de teclado detectado. Obrigado.

source: There doesn't seem to be enough free disk space in drive $c. For a complete desktop install, it is recommended to have at least 3 GB. If there is already a separate disk or partition for this install, or if you plan to replace Windows completely, you can safely ignore this warning.
is: Það lítur út fyrir að ekki sé nægilegt laust diskpláss á $c drifinu. Til þess að setja upp fullbúið skjáborðsumhverfi er mælt með að til staðar séu að minnsta kosti 3 GB. Ef þegar er til staðar annar diskur eða disksneið undir uppsetninguna, eða ef þú ætlar að skipta endanlega út Windows kerfinu, þá geturðu hunsað þessa aðvörun.
pt: Parece não existir espaço livre em disco suficiente na drive $c. Para uma instalação completa de desktop, é recomendado ter pelo menos 3 GB. Se já existir um disco ou partição separada para esta instalação, ou se planeia substituir completamente o Windows, pode ignorar este aviso em segurança.

source: Error: not enough free disk space. Aborting install.
is: Villa: ekki nægilegt diskpláss. Hætti uppsetningu.
pt: Erro: não existe espaço livre em disco suficiente. A cancelar a instalação.

source: This program doesn't support Windows $windows_version yet.
is: Þetta forrit styður ekki Windows $windows_version ennþá.
pt: Este programa ainda não suporta o Windows $windows_version.

source: The system version you're trying to install is designed to run on modern, 64-bit computers. However, your computer is incapable of running 64-bit programs. Use the 32-bit ("i386") version, or the Multi-arch version which is able to install either of them. This installer will abort now.
is: Útgáfa stýrikerfisins sem þú ert að reyna að setja upp er hönnuð til að keyra á nútímalegum 64-bita tölvum. Tölvan þín er aftur á móti ófær um að keyra 64-bita forrit. Notaðu 32-bita ("i386") útgáfu, eða svokallaða Multi-arch útgáfu sem getur sett upp hvora gerðina sem er. Uppsetningarforritið hættir núna.
pt: A versão do sistema que está a tentar instalar é desenhada para correr em computadores modernos a 64-bit. No entanto, o seu computador é incapaz de correr programas 64-bit. Utilize a versão 32-bit ("i386"), ou a versão 'Multi-arch' que permite instalar ambos. O instalador irá agora cancelar.

source: Your computer is capable of running modern, 64-bit operating systems. However, the system version you're trying to install is designed to run on older, 32-bit hardware. You may still proceed with this install, but in order to take the most advantage of your computer, we recommend that you use the 64-bit ("amd64") version instead, or the Multi-arch version which is able to install either of them. Would you like to abort now?
is: Tölvan þín er hönnuð til að keyra nútímaleg 64-bita stýrikerfi. Sú útgáfa stýrikerfis sem þú ert að setja upp er aftur á móti hönnuð til að keyra á eldri 32-bita vélbúnaði. Þú getur haldið áfram með þessa uppsetningu, en til þess að nýta sem best ýmsa kosti tölvunnar, þá mælum við með að þú notir frekar 64-bita ("amd64") útgáfu, eða svokallaða Multi-arch útgáfu sem getur sett upp hvora gerðina sem er. Viltu hætta í uppsetningarforritinu núna?
pt: O seu computador é capaz de correr sistemas operativos modernos a 64-bit. No entanto, a versão do sistema que está a tentar instalar é desenhada para correr em hardware antigo a 32-bit. Pode mesmo assim continuar com esta instalação, mas de modo a tirar toda a vantagem do seu computador, nós recomendamos que utilize a versão 64-bit ("amd64") de Debian, ou a versão 'Multi-arch' que é capaz de instalar ambos. Deseja cancelar agora?

source: Unable to find "system partition", assuming it is the same as the "boot partition" ($c).
is: Gat ekki fundið "kerfisdisksneiðina" (system partition), geri ráð fyrir að það sé sú sama og "ræsidisksneiðin" ($c).
pt: Não foi possível encontrar a "Partição de sistema", assumindo que é a mesma que a "Partição de arranque" ($c).

source: Select install mode:
is: Veldu uppsetningarham:
pt: Escolha o modo de instalação:

source: Normal mode. Recommended for most users.
is: Venjulegur. Ráðlagt fyrir flesta notendur.
pt: Modo normal. Recomendado para a maioria dos utilizadores.

source: Expert mode. Recommended for expert users who want full control of the install process.
is: Sérfræðingshamur. Fyrir vana notendur sem vilja fulla stjórrn á uppsetningarferlinu.
pt: Modo Avançado. Recomendado para os utilizadores avançados que querem o controlo total do processo de instalação.

source: PXE mode: install a PXE loader to allow remote kernel loading.
is: PXE hamur: setja upp PXE gangsetningarforrit til að hægt sé að hlaða inn kjarna af annarri tölvu.
pt: Modo PXE: instalar um carregador PXE para permitir carregar um kernel remoto.

source: Select action:
is: Veldu aðgerð:
pt: Escolha a acção:

source: Begin install on this computer.
is: Hefja uppsetningu á þessari tölvu.
pt: Iniciar a instalação neste computador.

source: Repair an installed system (rescue mode).
is: Gera við uppsett kerfi (rescue mode).
pt: Reparar um sistema instalado (modo de recuperação).

source: Select the kernel:
is: Veldu kjarnann:
pt: Escolha o kernel:

source: Graphical install
is: Myndræn uppsetning
pt: Instalação gráfica

source: Text install
is: Textauppsetning
pt: Instalação em modo de texto

source: Connecting ...
is: Tengist ...
pt: A ligar...

source: $1 left - $2 of $4$0$(^Byte) ($3$0$(^Byte)/s)
pt: Falta $1 - $2 de $4$0$(^Byte) ($3$0$(^Byte)/s)

source: Select which version of Debian-Installer to use:
is: Veldu hvaða útgáfu af Debian-uppsetningarforritinu eigi að nota:
pt: Escolha a versão do Instalador de Debian a utilizar:

source: Stable release. This will install Debian "stable".
is: Stöðug útgáfa. Þetta mun setja upp stöðugu Debian "stable" útgáfuna.
pt: Lançamento Estável. Isto irá instalar Debian "stable".

source: Daily build. This is the development version of Debian-Installer. It will install Debian "testing" by default, and may be capable of installing "stable" or "unstable" as well.
is: Dagleg útgáfa. Þetta er þróunarútgáfa Debian-uppsetningarforritsins. Hún mun sjálfgefið setja upp Debian "testing" prófunarútgáfuna, en gæti verið fær um að setja líka upp stöðugu útgáfuna "stable" eða óstöðugu útgáfuna "unstable".
pt: Compilação diária. Esta é a versão de desenvolvimento do Instalador de Debian. Por omissão, irá instalar Debian "testing", e pode ser capaz de instalar também a "stable" ou a "unstable".

source: It is recommended that you check for known issues before using a daily build. Would you like to do that now?
is: Mælt er með því að þú athugir með þekkt vandamál áður en daglega útgáfan er notuð. Viltu gera það núna?
pt: É recomendado que verifique se existem problemas conhecidos antes de utilizar uma compilação diária. Deseja fazê-lo agora?

source: The following parameters will be used. Do NOT change any of these unless you know what you're doing.
is: Eftirfarandi viðföng verða notuð. EKKI BREYTA neinum þeirra nema að þú vitir hvað þú ert að gera.
pt: Serão utilizados os seguintes parâmetros. NÃO altere nenhum destes a menos que saiba o que está a fazer.

source: Proxy settings (host:port):
is: Stillingar milliþjóns (hýsivél:gátt):
pt: Configurações do proxy (máquina:porto):

source: Location of boot.ini:
is: Staðsetning boot.ini:
pt: Localização do boot.ini:

source: Base URL for netboot images (linux and initrd.gz):
is: Grunnslóð (URL) netboot ræsidiskmynda (linux og initrd.gz):
pt: URL base para as imagens netboot (linux e initrd.gz):

source: Error
is: Villa
pt: Erro

source: Error: failed to copy $0 to $1.
is: Villa: mistókst að afrita $0 í $1.
pt: Erro: falhou copiar $0 para $1.

source: Checking GPG signature on $0.
is: Athuga GPG undirritun á $0.
pt: Verificar a assinatura GPG em $0.

source: The downloaded $0 file cannot be trusted! Aborting.
is: Skránni $0 sem náð var í er ekki hægt að treysta! Hætti.
pt: O ficheiro $0 a que foi feito download não pode ser confiado! A abortar.

source: Checksum mismatch for $0/$2. Got $1 when expecting $4. Aborting.
is: Mismunur á gátsummum $0/$2. Fékk $1 en bjóst við $4. Hætti.
pt: A verificação de controlo difere para $0/$2. Obteve $1 quando esperava $4. A abortar.

source: Computing checksum for $2
is: Reikna út gátsummu fyrir $2
pt: A calcular a verificação de controlo para $2

source: Generating $0
is: Bý til $0
pt: A gerar $0

source: Appending preseeding information to $0
is: Bæti forskráningarupplýsingum (preseeding info) við $0
pt: A acrescentar informação de 'preseeding' a $0

source: Error: unable to run $0.
is: Villa: tókst ekki að keyra $0.
pt: Erro: não foi possível correr $0.

source: Disabling NTFS compression in bootstrap files
is: Geri NTFS þjöppun í bootstrap skrám óvirka
pt: A desactivar a compressão NTFS em ficheiros de arranque

source: Registering in NTLDR
is: Skrifa inn í NTLDR
pt: A registar no NTLDR

source: Registering in BootMgr
is: Skrifa inn í BootMgr
pt: A registar no BootMgr

source: Error: failed to parse bcdedit.exe output.
is: Villa: tókst ekki að þátta úttak bcdedit.exe.
pt: Erro: falhou a interpretação da saída de bcdedit.exe.

source: Error: $0 not found. Is this really Windows $windows_version?
is: Villa: $0 fannst kki. Er þetta í alvörunni Windows $windows_version?
pt: Erro: $0 não encontrado. Isto é realmente o Windows $windows_version?

source: VERY IMPORTANT NOTICE:\n\n
is: MJÖG ÁRÍÐANDI ATHUGASEMD:\n\n
pt: AVISO MUITO IMPORTANTE:\n\n

source: The second stage of this install process will now be started. After your confirmation, this program will restart Windows in DOS mode, and automatically load the next part of the install process.\n\n
is: Næsta stig uppsetningarinnar mun hefjast hér á eftir. Þegar þú hefur staðfest, þá mun þetta forrit endurræsa Windows í DOS-ham og hlaða sjálfkrafa inn næsta stigi uppsetningarinnar.\n\n
pt: Vai agora ser iniciada a segunda etapa deste processo de instalação. Após a sua confirmação, este programa irá reiniciar o Windows no modo DOS, e carregar automaticamente a próxima etapa do processo de instalação.\n\n

source: You need to reboot in order to proceed with the install process. During your next boot, you will be asked whether you want to start Windows or continue with the install process.\n\n
is: Þú verður að endurræsa vélina til að halda áfram með uppsetningarferlið. Við næstu ræsingu verður þú spurð(ur) hvort þú viljir ræsa Windows eða halda áfram með uppsetningarferlið.\n\n
pt: É necessário que você reinicie de modo a continuar com o processo de instalação. Durante o próximo arranque, ser-lhe-á perguntado se deseja iniciar o Windows ou continuar com o processo de instalação.\n\n

source: During the install process, you will be offered the possibility of either reducing your Windows partition or completely replacing it. In both cases, it is STRONGLY RECOMMENDED that you have previously made a backup of your data. The authors of this software will NOT take ANY RESPONSIBILITY in the event of data loss.\n\nOnce your install is complete (and if you have chosen to keep Windows in your disk), you can uninstall this loader through the Windows Add/Remove Programs dialog in Control Panel.
is: Á meðan á uppsetningarferlinu stendur verður þér boðið að minnka Windows disksneiðina eða að skipta henni algerlega út. Í báðum tilfellum ER MÆLST TIL að þú hafir ÁÐUR tekið afrit af gögnunum þínum. Höfundar þessa hugbúnaðar TAKA ENGA ÁBYRGÐ varðandi mögulegt gagnatap við notkun hugbúnaðarins.\n\nEftir að uppsetningu er lokið (og ef þú hefur valið að halda Windows á disknum), þá geturðu hent út þessum hleðsluhugbúnaði með því að fara í Add/Remove Programs gluggann í Control Panel í Windows.
pt: Durante o processo de instalação, ser-lhe-á oferecida a possibilidade de reduzir a partição de Windows ou substitui-la completamente. Em ambos os casos, é FORTEMENTE RECOMENDADO que tenha feito previamente uma cópia de segurança dos seus dados. Os autores deste software NÃO irão assumir QUALQUER RESPONSABILIDADE no caso de perda de dados.\n\nUma vez que a sua instalação esteja terminada (e se escolheu manter o Windows no seu disco), pode desinstalar este carregador através da caixa de diálogo Adicionar/Remover Programas no Painel de Controlo do Windows.

source: Do you want to reboot now?
is: Viltu endurræsa núna?
pt: Deseja reiniciar agora?
