{
"d0101": {
"y": "开业.开工.安门.安床.",
"j": "结婚.领证.出行.安葬."
	},
	"d0102": {
"y": "结婚.领证.安葬.祭祀.",
"j": "入宅.作灶.盖屋."
	},
	"d0103": {
"y": "搬家.入宅.安门.出行.",
"j": "伐木."
	},
	"d0104": {
"y": "搬家.装修.结婚.入宅.",
"j": "入宅."
	},
	"d0105": {
"y": "祭祀.破屋.坏垣.",
"j": "."
	},
	"d0106": {
"y": "搬家.装修.开业.结婚.",
"j": "安葬.作灶.开光."
	},
	"d0107": {
"y": "搬家.开业.入宅.开工.",
"j": "结婚.领证.安葬.理发."
	},
	"d0108": {
"y": "结婚.领证.理发.嫁娶.",
"j": "安葬.作灶.破土.纳畜."
	},
	"d0109": {
"y": "搬家.结婚.入宅.领证.",
"j": "开业.开工.安葬.开张."
	},
	"d0110": {
"y": "开业.结婚.领证.开工.",
"j": "入宅.安床.安葬."
	},
	"d0111": {
"y": "安床.安葬.破土.祈福.",
"j": "结婚.领证.安门.订婚."
	},
	"d0112": {
"y": "结婚.领证.安床.出行.",
"j": "动土.安葬.破土.开光."
	},
	"d0113": {
"y": "搬家.入宅.动土.订婚.",
"j": "开业.结婚.领证.开工."
	},
	"d0114": {
"y": "开业.开工.安床.安葬.",
"j": "结婚.领证.动土.破土."
	},
	"d0115": {
"y": "作灶.祭祀.掘井.",
"j": "结婚.领证.安葬."
	},
	"d0116": {
"y": "开业.开工.动土.安葬.",
"j": "搬家.结婚.入宅.领证."
	},
	"d0117": {
"y": "搬家.结婚.领证.出行.",
"j": "搬家.结婚.领证.出行."
	},
	"d0118": {
"y": "开业.开工.动土.开张.",
"j": "祭祀.解除.求医."
	},
	"d0119": {
"y": ".",
"j": "沐浴.结网."
	},
	"d0120": {
"y": "结婚.入宅.领证.安葬.",
"j": "."
	},
	"d0121": {
"y": ".",
"j": "解除."
	},
	"d0122": {
"y": ".",
"j": "搬家.开业.结婚.入宅."
	},
	"d0123": {
"y": "安葬.作灶.祈福.祭祀.",
"j": "结婚.领证.安床.出行."
	},
	"d0124": {
"y": "开业.开工.开张.开市.",
"j": "出行.旅游.教牛马.造畜稠."
	},
	"d0125": {
"y": ".",
"j": "搬家.装修.入宅.动土."
	},
	"d0126": {
"y": "开业.结婚.领证.开工.",
"j": "装修.入宅.安门.上梁."
	},
	"d0127": {
"y": "祭祀.解除.平治道涂.",
"j": "."
	},
	"d0128": {
"y": "动土.交易.祈福.祭祀.",
"j": "结婚.领证.安床.出行."
	},
	"d0129": {
"y": "装修.入宅.安门.安床.",
"j": "开业.开工.动土.交易."
	},
	"d0130": {
"y": "祭祀.解除.破屋.",
"j": "."
	},
	"d0131": {
"y": "塞穴.",
"j": "."
	},
	"d0201": {
"y": "动土.安床.订婚.安葬.",
"j": "."
	},
	"d0202": {
"y": "解除.",
"j": "."
	},
	"d0203": {
"y": "搬家.开业.结婚.入宅.",
"j": "安葬.祭祀.入殓."
	},
	"d0204": {
"y": "安床.安葬.交易.破土.",
"j": "开业.结婚.领证.开工."
	},
	"d0205": {
"y": "出行.旅游.祭祀.扫舍.",
"j": "安葬.破土.开光."
	},
	"d0206": {
"y": "订婚.求嗣.祈福.祭祀.",
"j": "入宅.出行.安葬.作灶."
	},
	"d0207": {
"y": "开业.结婚.领证.开工.",
"j": "装修.入宅.动土.安葬."
	},
	"d0208": {
"y": "作灶.祭祀.结网.畋猎.",
"j": "结婚.领证.安床.嫁娶."
	},
	"d0209": {
"y": "安葬.破土.祭祀.解除.",
"j": "结婚.入宅.领证.上梁."
	},
	"d0210": {
"y": "搬家.开业.结婚.入宅.",
"j": "."
	},
	"d0211": {
"y": "搬家.装修.结婚.入宅.",
"j": "开业.开工.开张.开市."
	},
	"d0212": {
"y": "祭祀.破屋.",
"j": "."
	},
        "d0213": {
"y": "搬家.结婚.入宅.领证.",
"j": "祈福."
        },
	"d0214": {
"y": "开业.开工.动土.订婚.",
"j": "结婚.领证.安葬."
	},
	"d0215": {
"y": "搬家.结婚.入宅.领证.",
"j": "动土.安葬."
	},
	"d0216": {
"y": "动土.订婚.交易.破土.",
"j": "结婚.领证.安葬."
	},
	"d0217": {
"y": "搬家.结婚.入宅.领证.",
"j": "赴任."
	},
	"d0218": {
"y": "结网.",
"j": "."
	},
	"d0219": {
"y": "结婚.领证.动土.出行.",
"j": "搬家.入宅."
	},
	"d0220": {
"y": "安床.订婚.作灶.订盟.",
"j": "开业.开工.安葬.开张."
	},
	"d0221": {
"y": "安葬.破土.沐浴.启钻.",
"j": "."
	},
	"d0222": {
"y": "搬家.开业.结婚.入宅.",
"j": "."
	},
	"d0223": {
"y": "出行.安葬.旅游.破土.",
"j": "装修.结婚.入宅.领证."
	},
	"d0224": {
"y": "祭祀.解除.破屋.",
"j": "."
	},
	"d0225": {
"y": "搬家.装修.结婚.入宅.",
"j": "."
	},
	"d0226": {
"y": "装修.开业.开工.动土.",
"j": "搬家.结婚.入宅.领证."
	},
	"d0227": {
"y": "解除.",
"j": "."
	},
	"d0228": {
"y": "开业.结婚.领证.开工.",
"j": "搬家.入宅.动土.安门."
	},
	"d0301": {
"y": "搬家.装修.结婚.入宅.",
"j": "开光.掘井."
	},
	"d0302": {
"y": "解除.",
"j": "."
	},
	"d0303": {
"y": "开业.入宅.开工.动土.",
"j": "结婚.领证.安床.作灶."
	},
	"d0304": {
"y": "认养.会亲友.",
"j": "动土.安葬.上梁.伐木."
	},
	"d0305": {
"y": "安葬.破土.沐浴.成服.",
"j": "搬家.结婚.领证.安床."
        },
	"d0306": {
"y": "搬家.开业.结婚.入宅.",
"j": "."
	},
	"d0307": {
"y": "装修.结婚.领证.动土.",
"j": "."
	},
	"d0308": {
"y": "解除.沐浴.破屋.",
"j": "."
	},
	"d0309": {
"y": "搬家.装修.结婚.入宅.",
"j": "开业.开工.开张.开市."
	},
	"d0310": {
"y": "开业.开工.动土.安床.",
"j": "搬家.结婚.入宅.领证."
	},
	"d0311": {
"y": "搬家.入宅.出行.订婚.",
"j": "装修.动土.安床.安葬."
	},
	"d0312": {
"y": "搬家.开业.开工.动土.",
"j": "搬家.装修.入宅.安门."
	},
	"d0313": {
"y": "搬家.结婚.入宅.领证.",
"j": "开业.开工.安门.开张."
	},
	"d0314": {
"y": "搬家.入宅.作灶.纳畜.",
"j": "结婚.领证.安葬."
	},
	"d0315": {
"y": "安葬.祭祀.启钻.入殓.",
"j": "动土.上梁."
	},
	"d0316": {
"y": "安床.出行.订婚.旅游.",
"j": "搬家.入宅.安葬."
	},
	"d0317": {
"y": "搬家.开业.结婚.入宅.",
"j": "动土."
        },
	"d0318": {
"y": "结婚.领证.祭祀.沐浴.",
"j": "安葬."
	},
	"d0319": {
"y": "搬家.开业.结婚.入宅.",
"j": "."
	},
	"d0320": {
"y": "搬家.装修.入宅.动土.",
"j": "开业.开工.安葬.开张."
	},
	"d0321": {
"y": ".",
"j": "."
	},
	"d0322": {
"y": "结婚.领证.订婚.安葬.",
"j": "开业.开工.开张.开市."
	},
	"d0323": {
"y": "动土.安葬.上梁.破土.",
"j": "结婚.领证.开光."
	},
	"d0324": {
"y": "祭祀.",
"j": "."
	},
	"d0325": {
"y": "搬家.装修.结婚.入宅.",
"j": "开业.开工.安葬.交易."
	},
	"d0326": {
"y": "装修.结婚.领证.动土.",
"j": "出行.安葬.旅游.祈福."
	},
	"d0327": {
"y": "祭祀.",
"j": "."
	},
	"d0328": {
"y": "搬家.开业.结婚.入宅.",
"j": "安葬.伐木.作梁."
	},
	"d0329": {
"y": "搬家.装修.开业.入宅.",
"j": "安床."
	},
	"d0330": {
"y": "理发.祭祀.沐浴.扫舍.",
"j": "装修.结婚.入宅.领证."
	},
	"d0331": {
"y": "搬家.装修.结婚.入宅.",
"j": "."
	},
	"d0401": {
"y": "搬家.装修.入宅.动土.",
"j": "开业.结婚.领证.开工."
	},
	"d0402": {
"y": "破屋.",
"j": "."
	},
	"d0403": {
"y": "装修.开业.开工.动土.",
"j": "搬家.结婚.领证.安门."
	},
	"d0404": {
"y": "装修.开业.开工.动土.",
"j": "搬家.结婚.入宅.领证."
	},
	"d0405": {
"y": "作灶.",
"j": "."
        },
	"d0406": {
"y": "解除.",
"j": "."
	},
	"d0407": {
"y": "装修.动土.安门.安床.",
"j": "搬家.结婚.入宅.领证."
	},
	"d0408": {
"y": "祭祀.断蚁.",
"j": "搬家.入宅.动土.移徙."
	},
	"d0409": {
"y": "搬家.装修.开业.结婚.",
"j": "安葬.作灶.破土.伐木."
	},
	"d0410": {
"y": "搬家.装修.开业.结婚.",
"j": "动土.安床.订婚.破土."
	},
	"d0411": {
"y": "结婚.领证.作灶.理发.",
"j": "出行.旅游.破土."
	},
	"d0412": {
"y": "搬家.装修.结婚.入宅.",
"j": "动土.破土."
	},
	"d0413": {
"y": "沐浴.",
"j": "."
	},
	"d0414": {
"y": "动土.订婚.安葬.破土.",
"j": "搬家.结婚.入宅.领证."
	},
	"d0415": {
"y": "祭祀.破屋.",
"j": "."
	},
	"d0416": {
"y": "搬家.开业.结婚.入宅.",
"j": "祈福."
	},
	"d0417": {
"y": "搬家.开业.结婚.入宅.",
"j": "."
        },
	"d0418": {
"y": "作灶.祭祀.纳财.",
"j": "开业.开工.开张.破土."
	},
	"d0419": {
"y": "搬家.开业.结婚.入宅.",
"j": "安葬."
	},
	"d0420": {
"y": "安葬.启钻.成服.除服.",
"j": "."
	},
	"d0421": {
"y": "搬家.结婚.入宅.领证.",
"j": "动土."
	},
	"d0422": {
"y": "结婚.领证.安葬.破土.",
"j": "开业.入宅.开工.开张."
	},
	"d0423": {
"y": "开业.结婚.领证.开工.",
"j": "动土.破土."
	},
	"d0424": {
"y": "结婚.领证.祭祀.沐浴.",
"j": "动土.安葬.破土.掘井."
	},
	"d0425": {
"y": "搬家.装修.开业.入宅.",
"j": "结婚.领证.安葬.修坟."
	},
	"d0426": {
"y": "安葬.破土.祭祀.解除.",
"j": "搬家.开业.结婚.入宅."
	},
	"d0427": {
"y": "破屋.",
"j": "."
	},
	"d0428": {
"y": "搬家.装修.开业.结婚.",
"j": "祭祀.祭祀.纳畜."
	},
	"d0429": {
"y": "搬家.装修.开业.结婚.",
"j": "."
	},
	"d0430": {
"y": "作灶.祭祀.纳财.纳畜.",
"j": "开业.开工.安床.安葬."
	},
	"d0501": {
"y": "开业.开工.开张.理发.",
"j": "结婚.入宅.领证.出行."
	},
	"d0502": {
"y": "安葬.破土.祭祀.启钻.",
"j": "."
	},
	"d0503": {
"y": "出行.交易.旅游.祭祀.",
"j": "搬家.结婚.领证.动土."
	},
	"d0504": {
"y": "搬家.装修.开业.结婚.",
"j": "."
	},
	"d0505": {
"y": "开业.结婚.领证.开工.",
"j": "搬家.装修.入宅.动土."
	},
	"d0506": {
"y": "祭祀.",
"j": "."
	},
	"d0507": {
"y": "装修.入宅.动土.安床.",
"j": "结婚.领证.作灶.理发."
	},
	"d0508": {
"y": "安葬.理发.破土.祭祀.",
"j": "搬家.开业.结婚.入宅."
	},
        "d0509": {
"y": "破屋.",
"j": "."
        },
	"d0510": {
"y": "开业.结婚.领证.开工.",
"j": "搬家.入宅.作灶.祭祀."
	},
	"d0511": {
"y": "搬家.装修.开业.结婚.",
"j": "纳畜.伐木.掘井."
	},
	"d0512": {
"y": "交易.作灶.祭祀.牧养.",
"j": "开业.开工.安床.出行."
	},
	"d0513": {
"y": "装修.结婚.领证.动土.",
"j": "搬家.出行.安葬.旅游."
	},
	"d0514": {
"y": "祭祀.立碑.沐浴.启钻.",
"j": "结婚.领证.安葬.破土."
	},
	"d0515": {
"y": "搬家.结婚.入宅.领证.",
"j": "动土."
	},
	"d0516": {
"y": "结婚.领证.出行.安葬.",
"j": "动土.作灶."
	},
	"d0517": {
"y": "装修.动土.订婚.安葬.",
"j": "开业.结婚.领证.开工."
	},
	"d0518": {
"y": "搬家.装修.入宅.出行.",
"j": "开业.开工.安葬.开张."
	},
	"d0519": {
"y": "沐浴.平治道涂.",
"j": "结婚.领证.祈福."
	},
	"d0520": {
"y": "搬家.结婚.入宅.领证.",
"j": "开业.开工.安葬.开张."
	},
	"d0521": {
"y": "安葬.破土.捕捉.结网.",
"j": "结婚.入宅.领证."
	},
	"d0522": {
"y": "沐浴.破屋.坏垣.",
"j": "."
	},
	"d0523": {
"y": "搬家.开业.结婚.入宅.",
"j": "动土."
	},
	"d0524": {
"y": "搬家.结婚.入宅.领证.",
"j": "开光."
	},
	"d0525": {
"y": "订婚.作灶.祈福.祭祀.",
"j": "动土."
	},
	"d0526": {
"y": "结婚.领证.动土.安床.",
"j": "装修.入宅.安门.上梁."
	},
	"d0527": {
"y": "搬家.装修.结婚.领证.",
"j": "作灶.理发.开光.盖屋."
	},
	"d0528": {
"y": "搬家.安门.出行.安葬.",
"j": "动土.安床.破土.掘井."
	},
	"d0529": {
"y": "安葬.理发.破土.祭祀.",
"j": "搬家.结婚.入宅.领证."
	},
	"d0530": {
"y": "牧养.纳畜.开光.塞穴.",
"j": "装修.开业.结婚.领证."
	},
	"d0531": {
"y": "作灶.沐浴.平治道涂.",
"j": "."
	},
	"d0601": {
"y": "装修.动土.安床.出行.",
"j": "搬家.结婚.领证.嫁娶."
	},
	"d0602": {
"y": "安葬.破土.祭祀.塞穴.",
"j": "."
	},
        "d0603": {
"y": "破屋.",
"j": "."
        },
	"d0604": {
"y": "安葬.祭祀.启钻.成服.",
"j": "."
	},
	"d0605": {
"y": "搬家.开业.结婚.入宅.",
"j": "出行.作灶.旅游.栽种."
	},
        "d0606": {
"y": "交易.祭祀.解除.纳财.",
"j": "搬家.结婚.入宅.领证."
        },
        "d0607": {
"y": "结婚.领证.安床.出行.",
"j": "搬家.入宅.安葬.纳畜."
        },
        "d0608": {
"y": "动土.安葬.破土.祭祀.",
"j": "装修.入宅.安门.出行."
        },
	"d0609": {
"y": "安门.出行.作灶.旅游.",
"j": "动土.安床.安葬.开生坟."
	},
	"d0610": {
"y": "装修.动土.安门.安床.",
"j": "搬家.结婚.入宅.领证."
	},
	"d0611": {
"y": "搬家.装修.入宅.安床.",
"j": "动土.安葬.作灶.破土."
	},
	"d0612": {
"y": "作灶.祭祀.沐浴.平治道涂.",
"j": "结婚.领证.安门.安葬."
	},
	"d0613": {
"y": "搬家.装修.结婚.入宅.",
"j": "开业.开工.开张.作灶."
	},
	"d0614": {
"y": "安葬.破土.祭祀.捕捉.",
"j": "开业.结婚.入宅.领证."
	},
	"d0615": {
"y": "安葬.祭祀.拆卸.沐浴.",
"j": "结婚.入宅.领证.作灶."
	},
	"d0616": {
"y": "祭祀.沐浴.破屋.",
"j": "搬家.入宅.出行.旅游."
	},
	"d0617": {
"y": "开业.结婚.入宅.领证.",
"j": "盖屋.冠笄.掘井."
	},
	"d0618": {
"y": "开业.开工.动土.安床.",
"j": "安葬."
	},
	"d0619": {
"y": "结婚.领证.祭祀.捕捉.",
"j": "搬家.入宅.作灶."
	},
	"d0620": {
"y": ".",
"j": "开业.开工.安葬.交易."
	},
	"d0621": {
"y": "搬家.结婚.入宅.领证.",
"j": "开业.开工.安床.交易."
	},
	"d0622": {
"y": "出行.旅游.祭祀.沐浴.",
"j": "搬家.开业.入宅.开工."
	},
	"d0623": {
"y": "出行.旅游.赴任.祭祀.",
"j": "."
	},
	"d0624": {
"y": ".",
"j": "."
	},
	"d0625": {
"y": "破土.沐浴.成服.除服.",
"j": "搬家.开业.结婚.入宅."
	},
	"d0626": {
"y": "搬家.装修.开业.结婚.",
"j": "."
	},
	"d0627": {
"y": "动土.安葬.上梁.修坟.",
"j": "搬家.结婚.入宅.领证."
	},
	"d0628": {
"y": "破屋.",
"j": "."
	},
	"d0629": {
"y": "搬家.装修.开业.结婚.",
"j": "."
	},
	"d0630": {
"y": "装修.开业.入宅.开工.",
"j": "搬家.结婚.领证.出行."
	},
	"d0701": {
"y": "结婚.领证.理发.祭祀.",
"j": "入宅.安葬.作灶.伐木."
	},
	"d0702": {
"y": "修坟.祭祀.立碑.启钻.",
"j": "."
	},
	"d0703": {
"y": "搬家.装修.结婚.领证.",
"j": "开业.入宅.开工.安床."
	},
	"d0704": {
"y": "出行.旅游.祭祀.",
"j": "."
	},
	"d0705": {
"y": "结婚.领证.动土.安床.",
"j": "安葬.作灶.伐木.作梁."
	},
	"d0706": {
"y": "搬家.开业.入宅.开工.",
"j": "结婚.领证.安葬.作灶."
        },
	"d0707": {
"y": "祭祀.沐浴.平治道涂.",
"j": "."
	},
	"d0708": {
"y": "搬家.装修.开业.结婚.",
"j": "."
	},
	"d0709": {
"y": "解除.",
"j": "."
        },
	"d0710": {
"y": "祭祀.破屋.坏垣.",
"j": "."
	},
	"d0711": {
"y": "搬家.搬家.装修.结婚.",
"j": "开业.开工.开张.开市."
	},
	"d0712": {
"y": "开业.开工.动土.安床.",
"j": "搬家.结婚.入宅.领证."
	},
	"d0713": {
"y": "结婚.领证.作灶.理发.",
"j": "开业.开工.上梁.开张."
	},
	"d0714": {
"y": "修坟.祭祀.启钻.成服.",
"j": "开业.结婚.入宅.领证."
	},
	"d0715": {
"y": "结婚.入宅.领证.订婚.",
"j": "安床.安葬.作灶."
	},
	"d0716": {
"y": "结婚.领证.安葬.破土.",
"j": "动土."
	},
	"d0717": {
"y": "作灶.",
"j": "安葬."
	},
	"d0718": {
"y": "入学.理发.沐浴.认养.",
"j": "结婚.入宅.领证."
	},
	"d0719": {
"y": "安葬.启钻.开光.针灸.",
"j": "开业.开工.动土.开张."
	},
	"d0720": {
"y": "祭祀.结网.",
"j": "."
	},
	"d0721": {
"y": "安葬.破土.启钻.成服.",
"j": "搬家.入宅."
	},
	"d0722": {
"y": "搬家.结婚.入宅.领证.",
"j": "开业.开工.开张.赴任."
	},
	"d0723": {
"y": "祭祀.解除.破屋.",
"j": "."
	},
	"d0724": {
"y": "订婚.订盟.牧养.纳财.",
"j": "安葬."
	},
	"d0725": {
"y": "搬家.开业.结婚.入宅.",
"j": "安门."
	},
	"d0726": {
"y": "祭祀.",
"j": "."
	},
	"d0727": {
"y": "开业.开工.动土.出行.",
"j": "结婚.入宅.领证.安门."
	},
	"d0728": {
"y": "安床.作灶.理发.祭祀.",
"j": "结婚.领证.安门.开光."
	},
	"d0729": {
"y": "搬家.结婚.领证.出行.",
"j": "动土.安葬.伐木.作梁."
	},
	"d0730": {
"y": "搬家.安床.出行.旅游.",
"j": "结婚.领证.动土.订婚."
	},
	"d0731": {
"y": "开业.开工.安葬.交易.",
"j": "搬家.结婚.入宅.领证."
	},
	"d0801": {
"y": "造畜稠.",
"j": "."
	},
	"d0802": {
"y": "安葬.破土.启钻.成服.",
"j": "."
	},
	"d0803": {
"y": "安葬.破土.祭祀.启钻.",
"j": "."
	},
	"d0804": {
"y": "祭祀.解除.破屋.",
"j": "."
	},
	"d0805": {
"y": "结婚.领证.订婚.求嗣.",
"j": "安门.出行.安葬.上梁."
	},
	"d0806": {
"y": "搬家.装修.开业.结婚.",
"j": "安葬.修坟.立碑.纳畜."
	},
	"d0807": {
"y": "结婚.领证.作灶.祭祀.",
"j": "开业.开工.安葬.开张."
	},
	"d0808": {
"y": "搬家.开业.结婚.入宅.",
"j": "安床."
	},
	"d0809": {
"y": "结婚.领证.动土.安床.",
"j": "开光."
	},
	"d0810": {
"y": "搬家.入宅.安门.安床.",
"j": "结婚.领证.安葬.破土."
	},
	"d0811": {
"y": "安床.出行.上梁.旅游.",
"j": "结婚.领证.动土.安葬."
	},
	"d0812": {
"y": "安床.订婚.安葬.理发.",
"j": "开业.结婚.入宅.领证."
	},
	"d0813": {
"y": "祭祀.解除.造畜稠.平治道涂.",
"j": "开业.结婚.入宅.领证."
	},
	"d0814": {
"y": "安葬.破土.启钻.成服.",
"j": "开业.入宅.开工.开张."
	},
	"d0815": {
"y": "搬家.装修.入宅.动土.",
"j": "作灶."
	},
	"d0816": {
"y": "结婚.领证.安床.订婚.",
"j": "开业.开工.交易.开张."
	},
	"d0817": {
"y": "祭祀.解除.破屋.",
"j": "."
	},
	"d0818": {
"y": "搬家.装修.动土.安床.",
"j": "盖屋."
	},
	"d0819": {
"y": "开业.开工.安床.订婚.",
"j": "结婚.入宅.领证.赴任."
	},
	"d0820": {
"y": "沐浴.",
"j": "."
	},
	"d0821": {
"y": ".",
"j": "."
	},
	"d0822": {
"y": "出行.订婚.安葬.旅游.",
"j": "入宅."
	},
	"d0823": {
"y": "出行.旅游.祭祀.沐浴.",
"j": "结婚.领证.动土.安葬."
	},
	"d0824": {
"y": "搬家.结婚.入宅.领证.",
"j": "开业.开工.开张."
	},
	"d0825": {
"y": ".",
"j": "."
	},
	"d0826": {
"y": "搬家.开业.入宅.开工.",
"j": "结婚.领证.动土.作灶."
	},
	"d0827": {
"y": "搬家.装修.结婚.入宅.",
"j": "."
	},
	"d0828": {
"y": "装修.动土.安床.安葬.",
"j": "搬家.开业.结婚.入宅."
	},
	"d0829": {
"y": "破屋.",
"j": "."
	},
	"d0830": {
"y": "搬家.装修.开业.结婚.",
"j": "安葬."
	},
	"d0831": {
"y": "安葬.理发.求嗣.修坟.",
"j": "搬家.入宅.出行.作灶."
	},
	"d0901": {
"y": "祭祀.沐浴.成服.除服.",
"j": "开业.结婚.领证.开工."
	},
	"d0902": {
"y": ".",
"j": "."
	},
	"d0903": {
"y": "安床.破土.祭祀.启钻.",
"j": "搬家.开业.结婚.入宅."
	},
	"d0904": {
"y": "祭祀.",
"j": "."
	},
	"d0905": {
"y": "搬家.装修.结婚.入宅.",
"j": "安床."
	},
	"d0906": {
"y": "安门.安床.理发.裁衣.",
"j": "搬家.结婚.入宅.领证."
	},
	"d0907": {
"y": "搬家.装修.开业.结婚.",
"j": "作灶.祈福.祭祀.伐木."
	},
	"d0908": {
"y": "祭祀.入殓.",
"j": "装修.入宅.动土.安门."
	},
	"d0909": {
"y": "装修.入宅.安床.订婚.",
"j": "作灶.伐木.掘井."
	},
	"d0910": {
"y": "搬家.装修.结婚.入宅.",
"j": "开业.开工.出行.安葬."
	},
	"d0911": {
"y": "祭祀.破屋.坏垣.",
"j": "."
	},
	"d0912": {
"y": "搬家.入宅.安床.出行.",
"j": "安门.作灶.开光.栽种."
	},
	"d0913": {
"y": "搬家.装修.出行.旅游.",
"j": "."
	},
	"d0914": {
"y": "安床.祭祀.沐浴.纳财.",
"j": "开业.开工.开张.破土."
	},
	"d0915": {
"y": "装修.动土.订婚.上梁.",
"j": "结婚.领证.作灶."
	},
	"d0916": {
"y": "出行.旅游.理发.沐浴.",
"j": "入宅."
	},
	"d0917": {
"y": ".",
"j": "入宅.动土."
	},
	"d0918": {
"y": "结婚.领证.出行.上梁.",
"j": "开业.开工.安葬.开张."
	},
	"d0919": {
"y": "开业.开工.安葬.上梁.",
"j": "结婚.领证.祈福."
	},
	"d0920": {
"y": ".",
"j": "."
	},
	"d0921": {
"y": "装修.动土.订婚.安葬.",
"j": "开业.结婚.领证.开工."
	},
	"d0922": {
"y": "搬家.装修.结婚.入宅.",
"j": "开业.开工.安葬.开张."
	},
	"d0923": {
"y": "破屋.坏垣.",
"j": "."
	},
	"d0924": {
"y": "装修.动土.交易.入学.",
"j": "安门.作灶.理发.栽种."
	},
	"d0925": {
"y": "解除.",
"j": "."
	},
	"d0926": {
"y": "理发.沐浴.",
"j": "结婚.入宅.领证.安门."
	},
	"d0927": {
"y": "动土.安床.破土.祈福.",
"j": "搬家.结婚.入宅.领证."
	},
	"d0928": {
"y": "装修.动土.安门.作灶.",
"j": "结婚.领证.安床.安葬."
	},
	"d0929": {
"y": "安葬.启钻.成服.除服.",
"j": "."
	},
	"d0930": {
"y": "搬家.开业.结婚.入宅.",
"j": "安葬.作灶.伐木.塑绘."
	},
	"d1001": {
"y": "装修.开业.开工.安床.",
"j": "搬家.结婚.入宅.领证."
	},
	"d1002": {
"y": "祭祀.",
"j": "."
	},
	"d1003": {
"y": "入宅.动土.安床.安葬.",
"j": "开业.结婚.领证.开工."
	},
	"d1004": {
"y": "祭祀.",
"j": "."
	},
	"d1005": {
"y": "祭祀.沐浴.破屋.",
"j": "."
	},
	"d1006": {
"y": "动土.安床.求嗣.祈福.",
"j": "安门.作灶.栽种."
	},
	"d1007": {
"y": "解除.",
"j": "."
	},
	"d1008": {
"y": "安葬.修坟.立碑.启钻.",
"j": "开业.结婚.领证.开工."
	},
	"d1009": {
"y": "作灶.祭祀.除服.",
"j": "开业.开工.安床.开张."
	},
	"d1010": {
"y": "作灶.沐浴.开光.冠笄.",
"j": "结婚.领证.出行.安葬."
	},
	"d1011": {
"y": "安床.出行.订婚.上梁.",
"j": "搬家.结婚.入宅.领证."
	},
	"d1012": {
"y": "祭祀.",
"j": "."
	},
	"d1013": {
"y": "搬家.装修.入宅.动土.",
"j": "出行.上梁.作灶.旅游."
	},
	"d1014": {
"y": "结婚.领证.安床.出行.",
"j": "."
	},
	"d1015": {
"y": "入殓.移柩.平治道涂.",
"j": "搬家.结婚.入宅.领证."
	},
	"d1016": {
"y": "搬家.装修.结婚.入宅.",
"j": "开业.开工.出行.安葬."
	},
	"d1017": {
"y": "装修.结婚.领证.动土",
"j": "开业.入宅.开工.开张."
	},
	"d1018": {
"y": "解除.破屋.",
"j": "."
	},
	"d1019": {
"y": "结婚.领证.出行.订婚.",
"j": "入宅."
	},
	"d1020": {
"y": "安葬.立碑.启钻.成服.",
"j": "破土."
	},
	"d1021": {
"y": "结婚.领证.作灶.祈福.",
"j": "安床.安葬.盖屋."
	},
	"d1022": {
"y": "开业.结婚.领证.开工.",
"j": "结婚.领证.安葬.嫁娶."
	},
	"d1023": {
"y": "安床.安葬.交易.祈福.",
"j": "结婚.入宅.领证.作灶."
	},
	"d1024": {
"y": "祭祀.解除.扫舍.",
"j": "."
	},
	"d1025": {
"y": "搬家.开业.入宅.开工.",
"j": "结婚.领证.出行.旅游."
	},
	"d1026": {
"y": "开业.结婚.领证.开工.",
"j": "装修.入宅.动土.安门."
	},
	"d1027": {
"y": "祭祀.解除.平治道涂.",
"j": "."
	},
	"d1028": {
"y": "结婚.领证.动土.求嗣.",
"j": "开业.入宅.开工.安门."
	},
	"d1029": {
"y": "搬家.装修.结婚.入宅.",
"j": "开业.入宅.开工.安门."
	},
	"d1030": {
"y": "破屋.",
"j": "."
	},
	"d1031": {
"y": "搬家.装修.开业.结婚.",
"j": "安床.祈福.纳畜."
	},
	"d1101": {
"y": "安葬.修坟.破土.祭祀.",
"j": "."
	},
	"d1102": {
"y": "祭祀.",
"j": "."
	},
	"d1103": {
"y": "搬家.开业.入宅.开工.",
"j": "结婚.领证.安葬.作灶."
	},
	"d1104": {
"y": "安床.安葬.交易.裁衣.",
"j": "结婚.入宅.领证.动土."
	},
	"d1105": {
"y": "祭祀.解除.针灸.教牛马.",
"j": "结婚.领证.动土.安葬."
	},
	"d1106": {
"y": "纳财.裁衣.成服.除服.",
"j": "搬家.结婚.入宅.领证."
	},
	"d1107": {
"y": "结婚.入宅.领证.出行.",
"j": "."
	},
	"d1108": {
"y": "入宅.安床.订婚.求嗣.",
"j": "安床.安葬.作灶."
	},
	"d1109": {
"y": "作灶.",
"j": "安门.安葬.祈福."
	},
	"d1110": {
"y": "装修.动土.安门.安床.",
"j": "安葬.作灶.盖屋."
	},
	"d1111": {
"y": "搬家.结婚.入宅.领证.",
"j": "开业.开工.动土.开张."
	},
	"d1112": {
"y": "破屋.",
"j": "."
	},
	"d1113": {
"y": "装修.结婚.入宅.领证.",
"j": "安床."
	},
	"d1114": {
"y": "安葬.破土.立碑.成服.",
"j": "结婚.入宅.领证.上梁."
	},
	"d1115": {
"y": "开业.开工.安床.订婚.",
"j": "安葬.作灶.伐木."
	},
	"d1116": {
"y": "开业.开工.出行.订婚.",
"j": "入宅.安葬.作灶."
	},
	"d1117": {
"y": "安葬.求嗣.祈福.祭祀.",
"j": "搬家.结婚.入宅.领证."
	},
	"d1118": {
"y": "安床.安葬.上梁.交易.",
"j": "结婚.入宅.领证.动土."
	},
	"d1119": {
"y": "搬家.开业.结婚.入宅.",
"j": "掘井.词讼."
	},
	"d1120": {
"y": "结婚.领证.安床.求嗣.",
"j": "搬家.开业.入宅.开工."
	},
	"d1121": {
"y": "作灶.解除.",
"j": "安门.出行.安葬.旅游."
	},
	"d1122": {
"y": "解除.",
"j": "."
	},
	"d1123": {
"y": "搬家.结婚.入宅.领证.",
"j": "开业.开工.开张.作灶."
	},
	"d1124": {
"y": "祭祀.解除.破屋.坏垣.",
"j": "."
	},
	"d1125": {
"y": "搬家.装修.入宅.动土.",
"j": "结婚.领证.安床.作灶."
	},
	"d1126": {
"y": "安葬.破土.成服.除服.",
"j": "."
	},
	"d1127": {
"y": "搬家.动土.安门.安床.",
"j": "结婚.领证.安葬.作灶."
	},
	"d1128": {
"y": "结婚.领证.动土.安床.",
"j": "入宅.出行.安葬.作灶."
	},
	"d1129": {
"y": "安床.安葬.作灶.祭祀.",
"j": "入宅.出火.词讼."
	},
	"d1130": {
"y": "交易.纳财.裁衣.伐木.",
"j": "."
	},
	"d1201": {
"y": "搬家.开业.结婚.入宅.",
"j": "."
	},
	"d1202": {
"y": "装修.结婚.领证.安门.",
"j": "搬家.入宅.安葬.作灶."
	},
	"d1203": {
"y": "祭祀.平治道涂.",
"j": "."
	},
	"d1204": {
"y": "搬家.开业.入宅.开工.",
"j": "动土.作灶.开光.盖屋."
	},
	"d1205": {
"y": "结婚.领证.动土.安葬.",
"j": "开业.入宅.开工.安床."
	},
	"d1206": {
"y": "安葬.理发.修坟.祭祀.",
"j": "结婚.入宅.领证.安床."
	},
	"d1207": {
"y": "破屋.",
"j": "."
	},
	"d1208": {
"y": "动土.安床.出行.订婚.",
"j": "作梁."
	},
	"d1209": {
"y": "开业.入宅.开工.动土.",
"j": "结婚.领证.安葬.嫁娶."
	},
	"d1210": {
"y": "祭祀.沐浴.捕捉.",
"j": "搬家.结婚.入宅.领证."
	},
	"d1211": {
"y": "搬家.装修.结婚.入宅.",
"j": "安葬."
	},
	"d1212": {
"y": "装修.动土.安床.订婚.",
"j": "开业.结婚.入宅.领证."
	},
	"d1213": {
"y": "开业.开工.安床.出行.",
"j": "动土.作灶.掘井."
	},
	"d1214": {
"y": "祭祀.塞穴.",
"j": "结婚.领证.安葬.作灶."
	},
	"d1215": {
"y": "开业.开工.上梁.交易.",
"j": "结婚.入宅.领证."
	},
	"d1216": {
"y": "成服.除服.冠笄.入殓.",
"j": "作灶.盖屋.探病."
	},
	"d1217": {
"y": "装修.结婚.入宅.领证.",
"j": "伐木."
	},
	"d1218": {
"y": "装修.动土.订婚.安葬.",
"j": "开业.开工.安床.开张."
	},
	"d1219": {
"y": "破屋.坏垣.求医.",
"j": "."
	},
	"d1220": {
"y": "搬家.结婚.入宅.领证.",
"j": "开光."
	},
	"d1221": {
"y": "搬家.开业.入宅.开工.",
"j": "结婚.领证.安葬.嫁娶."
	},
	"d1222": {
"y": "结婚.领证.安床.纳财.",
"j": "开业.开工.安葬.开张."
	},
	"d1223": {
"y": "装修.入宅.动土.出行.",
"j": "开业.开工.安葬.开张."
	},
	"d1224": {
"y": "安床.订婚.安葬.交易.",
"j": "结婚.入宅.领证.祭祀."
	},
	"d1225": {
"y": "结婚.领证.安床.出行.",
"j": "动土.作灶.掘井."
	},
	"d1226": {
"y": ".",
"j": "结婚.领证.安门.安葬."
	},
	"d1227": {
"y": "开业.开工.安门.安床.",
"j": "结婚.领证.出行.安葬."
	},
	"d1228": {
"y": "结婚.领证.安葬.祭祀.",
"j": "入宅.作灶.盖屋."
	},
	"d1229": {
"y": "搬家.入宅.安门.出行.",
"j": "伐木."
	},
	"d1230": {
"y": "搬家.装修.结婚.领证.",
"j": "入宅."
	},
	"d1231": {
"y": "祭祀.破屋.坏垣.",
"j": "."
	}
}
